#+TITLE: dark-mode
#+DATE: 2024-08-17T17:52:00+0800
#+LASTMOD: 2024-09-01T11:59:08+0800
#+TYPE: docs
#+AUTHOR: Jiacai Liu
#+DESCRIPTION: Configuring "Dark mode" for macOS.

#+begin_src bash :results verbatim :exports results :wrap example :dir ../../..
./zig-out/bin/dark-mode -h
#+end_src

#+RESULTS:
#+begin_example
 USAGE:
     ./zig-out/bin/dark-mode [OPTIONS] [--] <command>

 Available commands:
   status                   View dark mode status
   on                       Turn dark mode on
   off                      Turn dark mode off
   toggle                   Toggle dark mode

 OPTIONS:
	-v, --version                     Print version
	-h, --help                        Print help information
#+end_example
